# Заполните массив элементами арифметической прогрессии. Её
# первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
a1 = int(input("Введите первый элемент прогрессии: "))
d = int(input("Введите разность прогрессии: "))
n = int(input("Введите количество элементов прогрессии: "))

progression = []

for i in range(n):
    progression.append(a1 + i * d)

print("Арифметическая прогрессия: ", progression)

# Определить индексы элементов массива (списка), значения которых
# принадлежат заданному диапазону (т.е. не меньше заданного минимума и не
# больше заданного максимума)

min_value = int(input("Введите минимальное значение диапазона: "))
max_value = int(input("Введите максимальное значение диапазона: "))

indexes = []

for i in range(len(progression)):
    if min_value <= progression[i] <= max_value:
        indexes.append(i)

print("Индексы элементов, принадлежащих заданному диапазону: ", indexes)
